tutorials/viscoelasticFluidFoam/Feta-PTT/0/lambdaEff
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      lambdaEff;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 1 0 0 0 0];

internalField   nonuniform List<scalar> 
108000
(
0.00356893
0.00359018
0.0035516
0.00358044
0.0035531
0.0035717
0.00355617
0.00356886
...
)
;

boundaryField
{
    fixedWalls
    {
        type            calculated;
        value           nonuniform List<scalar> 
10800
(
0.00356893
0.00359173
0.00359699
0.00359725
0.00359809
0.00359762
0.00359825
0.00359772
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.0036;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
1800
(
0.00359817
0.00359928
0.00359572
0.0035962
0.00359235
0.00359209
0.00358918
0.00358856
...
)
;
    }
}


// ************************************************************************* //
